# Используем официальный образ Node.js для ARM архитектуры
FROM node
# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы package.json и package-lock.json
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы проекта внутрь контейнера
COPY . .

# Определяем переменные окружения, если это необходимо
# ENV BOT_TOKEN=your_bot_token

# Определяем порт, который будет открыт в контейнере
# EXPOSE 3000

# Команда, которая будет выполняться при запуске контейнера
CMD ["npm", "run", "parse"]
